bin/fio_results/fio_ext4.log
ext4_randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.35
Starting 4 processes
ext4_randrw: Laying out IO file (1 file / 1024MiB)
ext4_randrw: Laying out IO file (1 file / 1024MiB)
ext4_randrw: Laying out IO file (1 file / 1024MiB)
fio: ENOSPC on laying out file, stopping
ext4_randrw: Laying out IO file (1 file / 1024MiB)
fio: ENOSPC on laying out file, stopping

ext4_randrw: (groupid=0, jobs=4): err=28 (file:filesetup.c:240, func=write, error=No space left on device): pid=4066: Tue May 20 21:07:45 2025
  read: IOPS=11.2k, BW=43.8MiB/s (45.9MB/s)(2625MiB/60001msec)
    clat (usec): min=2, max=13277k, avg=167.61, stdev=26961.23
     lat (usec): min=2, max=13277k, avg=167.65, stdev=26961.23
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   20], 10.00th=[   25], 20.00th=[   32],
     | 30.00th=[   42], 40.00th=[   70], 50.00th=[   81], 60.00th=[   91],
     | 70.00th=[  104], 80.00th=[  128], 90.00th=[  161], 95.00th=[  215],
     | 99.00th=[  445], 99.50th=[  635], 99.90th=[ 1844], 99.95th=[ 2638],
     | 99.99th=[ 4178]
   bw (  KiB/s): min=11174, max=139136, per=100.00%, avg=71112.22, stdev=14238.49, samples=149
   iops        : min= 2793, max=34784, avg=17777.83, stdev=3559.63, samples=149
  write: IOPS=11.2k, BW=43.8MiB/s (45.9MB/s)(2628MiB/60001msec); 0 zone resets
    clat (nsec): min=1334, max=4373.3k, avg=6354.07, stdev=9965.03
     lat (nsec): min=1358, max=4373.3k, avg=6422.03, stdev=9996.45
    clat percentiles (nsec):
     |  1.00th=[  1544],  5.00th=[  1656], 10.00th=[  1736], 20.00th=[  1944],
     | 30.00th=[  2544], 40.00th=[  3056], 50.00th=[  3472], 60.00th=[  4256],
     | 70.00th=[  7968], 80.00th=[ 11200], 90.00th=[ 12864], 95.00th=[ 15808],
     | 99.00th=[ 28032], 99.50th=[ 37120], 99.90th=[ 83456], 99.95th=[118272],
     | 99.99th=[189440]
   bw (  KiB/s): min=11141, max=141384, per=100.00%, avg=71202.18, stdev=14222.65, samples=149
   iops        : min= 2785, max=35346, avg=17800.31, stdev=3555.69, samples=149
  lat (usec)   : 2=10.66%, 4=18.18%, 10=7.24%, 20=15.65%, 50=14.48%
  lat (usec)   : 100=17.51%, 250=14.53%, 500=1.35%, 750=0.20%, 1000=0.08%
  lat (msec)   : 2=0.07%, 4=0.04%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 500=0.01%, 1000=0.01%, 2000=0.01%, >=2000=0.01%
  cpu          : usr=0.20%, sys=9.41%, ctx=679760, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=672126,672836,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=43.8MiB/s (45.9MB/s), 43.8MiB/s-43.8MiB/s (45.9MB/s-45.9MB/s), io=2625MiB (2753MB), run=60001-60001msec
  WRITE: bw=43.8MiB/s (45.9MB/s), 43.8MiB/s-43.8MiB/s (45.9MB/s-45.9MB/s), io=2628MiB (2756MB), run=60001-60001msec

Disk stats (read/write):
  loop3: ios=667962/400938, merge=0/22, ticks=104867/902593, in_queue=1032473, util=97.17%